app/Controllers/Home.php

SELECT *
FROM `productos`
ORDER BY `id_producto` DESC
---
    public function index()
    {
        $productoModel = new productos_Model();
        $dato['producto'] = $productoModel->orderBy('id_producto', 'DESC')->findAll();