app/Controllers/productos_Controller.php

SELECT *
FROM `productos`
ORDER BY `id_producto` DESC
---
    public function index()
    {
        $productoModel = new productos_Model();
        $data['producto'] = $productoModel->orderBy('id_producto', 'DESC')->findAll();

INSERT INTO `productos` (`nombre_prod`, `imagen`, `id_categoria`, `precio`, `precio_vta`, `stock`, `stock_min`) VALUES ('auricular', '1716177967_1cfea0c4d787b2449d09.png', '2', '9999.99', '14999.99', '5', '10')
---
                    'stock_min'    => $this->request->getVar('stock_min'),
                ];
            }
            $productoModel->insert($data);

SELECT *
FROM `productos`
WHERE `id_producto` = '7'
 LIMIT 1
UPDATE `productos` SET `nombre_prod` = 'Mouse Redragon Centrophorus M601 RGB', `id_categoria` = '2', `precio` = '4999.99', `precio_vta` = '7999.99', `stock` = '15', `stock_min` = '10'
WHERE `productos`.`id_producto` IN ('7')
---
    public function modificar($id)
    {
        $productoModel = new productos_Model();
        $producto = $productoModel->where('id_producto', $id)->first();

        if (empty($producto)) {
            session()->setFlashdata('warning', '¡El producto no existe!');
            return redirect()->to(base_url('editar/' . $id));
        }

        if ($this->request->getVar('id_categoria') == 0) {
            session()->setFlashdata('warning', '¡Ingrese una categoría válida!');
            return redirect()->to(base_url('editar/' . $id));
        } elseif ($this->request->getVar('precio') < 0 || $this->request->getVar('precio_vta') < 0) {
            session()->setFlashdata('warning-2', '¡Ingrese un precio mayor a 0!');
            return redirect()->to(base_url('editar/' . $id));
        }

        $data = [
            'nombre_prod'  => $this->request->getVar('nombre_prod'),
            'id_categoria' => $this->request->getVar('id_categoria'),
            'precio'       => $this->request->getVar('precio'),
            'precio_vta'   => $this->request->getVar('precio_vta'),
            'stock'        => $this->request->getVar('stock'),
            'stock_min'    => $this->request->getVar('stock_min'),
        ];

        $productoModel->update($id, $data);