app/Controllers/usuario_crud_controller.php

    public function principal()
    {
        $userModel = new usuario_model();
        $data['users'] = $userModel->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

    public function singleUser($id = null)
    {
        $userModel = new usuario_model();
        $data['user_obj'] = $userModel->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '4'
 LIMIT 1

    public function update()
    {
        $userModel = new usuario_model();
        $id = $this->request->getVar('id_usuario');
        $data = [
            'nombre' => $this->request->getVar('nombre'),
            'apellido' => $this->request->getVar('apellido'),
            'nombre_usuario' => $this->request->getVar('nombre_usuario'),
            'email'  => $this->request->getVar('email'),
            'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
            'id_perfil' => $this->request->getVar('id_perfil'),
            'baja' => $this->request->getVar('baja'),
        ];
        $userModel->update($id, $data);
---
UPDATE `usuarios` SET `baja` = 'NO'
WHERE `usuarios`.`id_usuario` IN ('4')